[
    {
        "id" : 1,
        "name":"Harry Potter and the Cursed Child",
        "author": "J.K ROWLING",
        "price" : 20,
        "oldPrice" : null,
        "description": "Harry Potter and the Cursed Child is a play written by Jack Thorne from an original story written by J. K. Rowling, Thorne and John Tiffany. The story is set nineteen years after the events of the 2007 novel Harry Potter and the Deathly Hallows by Rowling.",
        "starRate" : 5,
        "reviewCount" : 1400,
        "stock" : 1500,
        "imgSource": "images/Harry Potter and the Cursed Child.jpeg",
        "type": "NOVEL"
    },
    {
        "id" : 2,
        "name":"Animal Farm",
        "author": "George Orwell",
        "price" : 11,
        "oldPrice" : null,
        "description": "Animal Farm is a beast fable, in the form of a satirical allegorical novella, by George Orwell, first published in England on 17 August 1945. It tells the story of a group of anthropomorphic farm animals who rebel against their human farmer, hoping to create a society where the animals can be equal, free, and happy",
        "starRate" : 4.6,
        "reviewCount" : 788,
        "stock" : 656,
        "imgSource": "images/Animal Farm.jpg",
        "type": "CHILDREN"
    },
    {
        "id" : 3,
        "name":"Rich Dad Poor Dad",
        "author": "Robert T. Kiyosaki",
        "price" : 44,
        "oldPrice" : null,
        "description": "Rich Dad Poor Dad is a 1997 book written by Robert T. Kiyosaki and Sharon Lechter. It advocates the importance of financial literacy, financial independence and building wealth through investing in assets, real estate investing, starting and owning businesses, as well as increasing one's financial intelligence.",
        "starRate" : 4.1,
        "reviewCount" : 342,
        "stock" : 1111,
        "imgSource": "images/Rich Dad Poor Dad.jpg",
        "type": "FINANCE"
    },
    {
        "id" : 4,
        "name":"Dar Koridor",
        "author": "Daron Acemoğlu",
        "price" : 39,
        "oldPrice" : null,
        "description": "From the authors of the international bestseller Why Nations Fail, a crucial new big-picture framework that answers the question of how liberty flourishes in some states but falls to authoritarianism or anarchy in others--and explains how it can continue to thrive despite new threats.",
        "starRate" : 4.3,
        "reviewCount" : 444,
        "stock" : 1200,
        "imgSource": "images/Dar Koridor.jpeg",
        "type": "FINANCE"
    },
    {
        "id" : 5,
        "name":"The Lord Of The Rings",
        "author": " J. R. R. Tolkien",
        "price" : 24,
        "oldPrice" : null,
        "description": "The former Fellowship members prepare for the final battle. While Frodo and Sam approach Mount Doom to destroy the One Ring, they follow Gollum, unaware of the path he is leading them to.",
        "starRate" : 4.8,
        "reviewCount" : 1666,
        "stock" : 500,
        "imgSource": "images/The Lord Of The Rings.jpg",
        "type": "NOVEL"
    },
    {
        "id" : 6,
        "name":"The Country Of White Lillies",
        "author": "Grigory Petrov",
        "price" : 21,
        "oldPrice" : 28,
        "description": "Finland, the country of white lilies is a journalistic book by Russian priest and social activist Grigory Spiridonovich Petrov. After the October Revolution, when Petrov lived in Serbia, he wrote a journalistic book, dedicated to Finland and Johan Vilhelm Snellman",
        "starRate" : 4.1,
        "reviewCount" : 1111,
        "stock" : 150,
        "imgSource": "images/The Country Of White Lilies.jpg",
        "type": "Self-Improvement"
    },
    {
        "id" : 7,
        "name":"Ulusların Düşüşü",
        "author": "Daron Acemoğlu",
        "price" : 10,
        "oldPrice" : null,
        "description": "Why Nations Fail: The Origins of Power, Prosperity, and Poverty, first published in 2012, is a book by economists Daron Acemoglu and James A. Robinson.",
        "starRate" : 3.8,
        "reviewCount" : 1367,
        "stock" : 666,
        "imgSource": "images/Ulusların Düşüşü.jpg",
        "type": "FINANCE"
    },
    {
        "id" : 8,
        "name":"The Gambler",
        "author": "Fyodor Mihayloviç Dostoyevski",
        "price" : 22,
        "oldPrice" : null,
        "description": "This anthology is a thorough introduction to classic literature for those who have not yet experienced these literary masterworks. For those who have known and loved these works in the past, this is an invitation to reunite with old friends in a fresh new format. From Shakespeare s finesse to Oscar Wilde s wit, this unique collection brings together works as diverse and influential as The Pilgrim s Progress and Othello. As an anthology that invites readers to immerse themselves in the masterpieces of the literary giants, it is must-have addition to any library.",
        "starRate" : 4.6,
        "reviewCount" : 1786,
        "stock" : 750,
        "imgSource": "images/The Gambler.jpg",
        "type": "NOVEL"
    },
    {
        "id" : 9,
        "name":"The Brothers Karamazov",
        "author": "Fyodor Mihayloviç Dostoyevski",
        "price" : 31,
        "oldPrice" : null,
        "description": "The Brothers Karamazov, also translated as The Karamazov Brothers, is the last novel by Russian author Fyodor Dostoevsky. Dostoevsky spent nearly two years writing The Brothers Karamazov, which was published as a serial in The Russian Messenger from January 1879 to November 1880",
        "starRate" : 4,
        "reviewCount" : 234,
        "stock" : 111,
        "imgSource": "images/The Brothers Karamazov.jpg",
        "type": "NOVEL"
    },
    {
        "id" : 10,
        "name":"Black Holes",
        "author": "Stephen Hawking",
        "price" : 20,
        "oldPrice" : null,
        "description": "At the BBC Reith lectures of 2016, Stephen Hawking accepted the truly formidable challenge of conveying a lifetime's worth of research in fifteen minutes.In these very short lectures, Hawking reveals the mysteries of the universe and emphasizes that we can access the secrets of spacetime if we understand black holes.",
        "starRate" : 3.4,
        "reviewCount" : 109,
        "stock" : 900,
        "imgSource": "images/Black Holes.jpg",
        "type": "SCIENCE"
    },
    {
        "id" : 11,
        "name":"Homo Sapiens",
        "author": "Yuval Noah Harari",
        "price" : 40,
        "oldPrice" : 51,
        "description": "Sapiens, From Animals to Gods, written by Israeli Writer and History Professor Yuval Noah Harari, is among the most popular books of recent years. The work, which deals with the historical journey of man from the beginning to the present, details all the conditions that created today in the light of scientific and social sciences.",
        "starRate" : 4.7,
        "reviewCount" : 2819,
        "stock" : 1321,
        "imgSource": "images/Homo Sapiens.jpg",
        "type": "HISTORY"
    },
    {
        "id" : 12,
        "name":"War and Peace",
        "author": "Tolstoy",
        "price" : 25,
        "oldPrice" : null,
        "description": "If everyone fought only for their own beliefs, there would be no war...",
        "starRate" : 4.1,
        "reviewCount" : 999,
        "stock" : 1200,
        "imgSource": "images/War and Peace.jpg",
        "type": "NOVEL"
    }
]